"""11/26/25
2024C_D封闭图形个数
    ----
分析
    输入:数字个数n
         空格分隔的n个数

    输出:按规则从小到大排序,空格分隔

    0 4 6 9封闭图形数1
    8封闭图形数2
    1 2 3 5 7为0

    先比较图形数,再比较数字大小
    
总结
    建立列表存储三种图形数,遍历传入字符串有多少图形并储存(字符串形式)
    对相同图形数字符串转换为整型比较大小
    最后输出
"""
n = int(input())
num = list(map(str, input().split()))

A = ['1', '2', '3', '5', '7']
B = ['0', '4', '6', '9']
C = ['8']

def var(x):
    cir = 0
    for _ in x:
        if _ in B:
            cir += 1
        elif _ in C:
            cir += 2
    return cir, int(x)   # 转为整型比较数值大小

num.sort(key = var)  
# 依次对num的字符串做var操作,随后依次按照输出的图形数,数值比较大小
print(*num)
# 直接以空格间隔输出列表元素(解包输出)