"""深度优先搜索--暂未正式开工
------------------------------------------------------------------------------------------
一些思路
    题目测试点巨大, 应使用nlogn情况, 可能会应用二分
    找到欲求解x, x相关的函数(单调的)
    边界问题, 初值与封顶
    注意判别方向
    目前采用闭区间写法 l<=r 条件

------------------------------------------------------------------------------------------
基本步骤
    问题转化, x选取
    x边界设定
    检查函数计算方法与单调性, 检查函数count(x)通常与所给的某个值比大小判断, 要把问题反过来看......
    确定"第一个"和"最后一个"判断要求
    码二分模板

------------------------------------------------------------------------------------------
"""